restarted in new directory
```

Terraform will perform the following actions:

  # module.app-engine.google_app_engine_application.main will be created
  + resource "google_app_engine_application" "main" {
      + app_id            = (known after apply)
      + auth_domain       = (known after apply)
      + code_bucket       = (known after apply)
      + database_type     = (known after apply)
      + default_bucket    = (known after apply)
      + default_hostname  = (known after apply)
      + gcr_domain        = (known after apply)
      + id                = (known after apply)
      + location_id       = "northamerica-northeast1"
      + name              = (known after apply)
      + project           = "gae-sandbox-3z8g-8f97"
      + serving_status    = "SERVING"
      + url_dispatch_rule = (known after apply)

      + feature_settings {
          + split_health_checks = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_name          = (known after apply)
  + default_hostname  = (known after apply)

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
michael@cloudshell:~/wse_github/gcp-landing-zone/google-app-engine-java (archetypes-boot-ot)$ gcloud services enable appengine.googleapis.com


Terraform will perform the following actions:

  # module.app-engine.google_app_engine_application.main will be created
  + resource "google_app_engine_application" "main" {
      + app_id            = (known after apply)
      + auth_domain       = (known after apply)
      + code_bucket       = (known after apply)
      + database_type     = (known after apply)
      + default_bucket    = (known after apply)
      + default_hostname  = (known after apply)
      + gcr_domain        = (known after apply)
      + id                = (known after apply)
      + location_id       = "northamerica-northeast1"
      + name              = (known after apply)
      + project           = "gae-sandbox-3z8g-8f97"
      + serving_status    = "SERVING"
      + url_dispatch_rule = (known after apply)

      + feature_settings {
          + split_health_checks = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_name          = (known after apply)
  + default_hostname  = (known after apply)

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
michael@cloudshell:~/wse_github/gcp-landing-zone/google-app-engine-java (archetypes-boot-ot)$ gcloud services enable appengine.googleapis.com
```